#include	"BoidsAI.h"
#include	"drawaxis.h"
#include    "CCamera.h"
#include"Notes_Arrange.h"
#include <cstdlib>
#include"BoidsAIMgr.h"
#include"CHeight_Map.h"
#include"billboardMgr.h"
#include"BoundingSphere.h"
#include<list>;
#include<math.h>
#include"CDirectInput.h"
#include"MouseCircle.h"
#include"ModelMgr.h"
#include"Scean.h"
#include"BulletMgr.h"
#include"UniqueEnemy_Bomb.h"
#include<random>

#define w_height window_height 
#define w_width window_width
#define PI 3.141592635
#define debuglog(a) std::cout<<a<<std::endl;

class Scean;
XAudio audio;						//音楽ならす


static float m_rig;//プレイヤーの現在の角度保存用

/// <summary>
/// AIのパラメーターのstatic変数
/// </summary>
/////////////////////////////////////////////////////////

//地形のスケール	
float scaling = Ground::GetInstance()->scaling;
	
/// <summary>
/// 小さく赤いAIの適応するかどうかのルール
/// </summary>

//分離
bool BoidsAI::hsepflg = false;
//整列
bool BoidsAI::haliflg = false;
//スロープ
bool BoidsAI::slopeflg = false;
//ポケット
bool BoidsAI::pocketflg = false;
//最高速度
float BoidsAI::hyumanmaxspeed;//1.5

float BoidsAI::hyumanrandspeed;//5
//整列の範囲
float BoidsAI::alidist;//40
//分離の範囲
float BoidsAI::sepdist;//10
//逃避範囲
float BoidsAI::sepzonbiedist;//30
//分離速度
float BoidsAI::sepspeed;//2.0
//逃げる時間
float BoidsAI::septime;//30

/// <summary>
/// 操作プレイヤーの変数
/// </summary>
bool BoidsAI::zdashflg = false;
bool BoidsAI::zscaflg = false;
bool BoidsAI::zsepflg = false;
bool BoidsAI::zcohflg = false;
bool BoidsAI::zserflg = false;
bool BoidsAI::zawaflg = false;

bool BoidsAI::dmgflg = false;
bool BoidsAI::changeflg = false;

bool BoidsAI::bbombflg = false;
bool BoidsAI::bserflg = false;
bool BoidsAI::texspeedflg = false;
bool BoidsAI::shootflg = false;


float BoidsAI::zonbiehp;//２
float BoidsAI::zonbiemaxspeed;//8.5
float BoidsAI::zonbiedownspeed;//0.05f
//////////////////////////////////////////////

//ユニークな敵の変数
float BoidsAI::bombdist;//100
//zonbiesearch
int BoidsAI::Searchcnt;//70
float BoidsAI::Seachspeed;//0.3f
float BoidsAI::Seachtime;//50

float BoidsAI::chasedist;//50
float BoidsAI::chasespeed;//1.5
float BoidsAI::chasetime;//30
float BoidsAI::Dashspeed;//3.5f
float BoidsAI::Dashtime;//40

//zonbiesep
float BoidsAI::Sepdist;//10
float BoidsAI::Sepspeed;//1.
					   
//集合速度
float BoidsAI::cohspeed;//１．０

//zombieaway
float BoidsAI::zombiawayspeed;//1.5
float BoidsAI::zombieawaytime;//１０

//ゾンビとのダメージ距離
float BoidsAI::zombirange;//15
float BoidsAI::damage;//１．０

bool BoidsAI::save = false;
bool BoidsAI::load = false;

float length = 200;
///////////////////////////////////////////////////////////




//go 元の座標値
//to　行先の座標値
//ratio　現在の進行割合　0.0f〜1.0f
template<typename T>
T LeapID(T _go, T _to, float _ratio)
{
	return _go * (1.0f - _ratio) + _to * (T)_ratio;
}

bool BoidsAI::Init() {

	// 行列初期化
	DX11MtxIdentity(m_mtx);

	//XYZの軸を取り出し保管
	SetQutenion();

	float posx = rand() % 400 - 200;//初期値
	float posz = rand() % 400 - 200;//初期値
	SetPos(XMFLOAT3(posx, 0.0f, posz));//初期値
	
	//角度の初期
	angle.x = 0.0f;
	angle.z = 0.0f;
	angle.y = 0.0f;

	return true;
}


bool BoidsAI::CharengerInit()
{
	// 行列初期化
	DX11MtxIdentity(m_mtx);

	//XYZの軸を取り出し保管
	SetQutenion();

	//場所の初期値
	float posx = rand() % 400;
	float posz = rand() % 400;
	posx -= 200;
	posz -= 200;
	//場所を０に
	SetPos(XMFLOAT3(0, 0, 0));
	//角度を調整
	angle.x = -90.0f;
	angle.z = 0.0f;
	angle.y = -90.0f;
	SetAngle();

	champion = true;

	return true;
