#include	"player.h"
#include	"drawaxis.h"
#include    "CCamera.h"
#include"Notes_Arrange.h"
#include <cstdlib>
#include"PlayerMgr.h"
#include"CHeight_Map.h"

#include"BoundingSphere.h"
#include<list>;
#include<math.h>
#include"CDirectInput.h"
#include"MouseCircle.h"
#include"ModelMgr.h"
#include"Scean.h"
#include"BulletMgr.h"
#include"UniqueEnemy_Bomb.h"

class Scean;

XAudio audio;						//音楽ならす


static float m_rig;//プレイヤーの現在の角度保存用
static float ay;
static float bay;

//float Player::accel = 0.0f;
#define debuglog(a) std::cout<<a<<std::endl;

float scaling = Ground::GetInstance()->scaling;


const int window_height = (CHeight_Map::GetInstance()->iPixSize - 60) * scaling;//マップの大きさ　縦
const int window_width = (CHeight_Map::GetInstance()->iPixSize - 60) * scaling;//マップの大きさ　横


#define w_height window_height 
#define w_width window_width
#define PI 3.141592635


bool Player::hsepflg = false;
 bool Player::haliflg = false;


 bool Player::zdashflg = false;
 bool Player::zscaflg = false;
 bool Player::zsepflg = false;
 bool Player::zcohflg = false;
 bool Player::zserflg = false;
 bool Player::zawaflg = false;

 bool Player::dmgflg = false;
 bool Player::changeflg = false;

 bool Player::bbombflg = false;
 bool Player::bserflg = false;


 //人間の速さ
  float Player:: hyumanmaxspeed;//1.5
  float Player:: hyumanrandspeed;//5

 //hyumanali
  float Player:: alidist;//40


 //hyumnsep
  float Player:: sepdist;//10
  float Player:: sepzonbiedist;//30
  float Player:: sepspeed;//2.0
  float Player:: septime;//30


  float Player:: zonbiehp;//２
  float Player:: zonbiemaxspeed;//8.5
  float Player:: zonbiedownspeed;//0.05f

 //zonbiedamage
  float Player:: bombdist;//100
 //zonbiesearch
  int Player::Searchcnt;//70
  float Player:: Seachspeed;//0.3f
  float Player:: Seachtime;//50

  float Player:: chasedist;//50
  float Player:: chasespeed;//1.5
  float Player:: chasetime;//30

  float Player:: Dashspeed;//3.5f
  float Player:: Dashtime;//40

 //zonbiesep
  float Player:: Sepdist;//10
  float Player:: Sepspeed;//1.0

 //集合速度
  float Player:: cohspeed;//１．０

 //ゾンビとのダメージ距離
  float Player:: zombirange;//15
  float Player:: damage;//１．０

   bool Player::save = false;
   bool Player::load = false;

//go 元の座標値
//to　行先の座標値
//ratio　現在の進行割合　0.0f〜1.0f
template<typename T>
T LeapID(T _go, T _to, float _ratio)
{
	return _go * (1.0f - _ratio) + _to * (T)_ratio;
}




bool Player::Init() {

	// 行列初期化
	DX11MtxIdentity(m_mtx);

	//XYZの軸を取り出し保管
	SetQutenion();

	float posx = rand() % 400 - 200;//初期値
	float posz = rand() % 400 - 200;//初期値
	SetPos(XMFLOAT3(posx, 0.0f, posz));//初期値
	
	angle.x = 0.0f;
	angle.z = 0.0f;
	angle.y = 0.0f;

	return true;
}


bool Player::CharengerInit()
{
	// 行列初期化
	DX11MtxIdentity(m_mtx);

	//XYZの軸を取り出し保管
	SetQutenion();

	float posx = rand() % 400;
	float posz = rand() % 400;
	posx -= 200;
	posz -= 200;
	SetPos(XMFLOAT3(0, 0.0f, 0));
	angle.x = -90.0f;
	angle.z = 0.0f;
	angle.y = -90.0f;
	SetAngle();
	champion = true;

	return true;
}



void Player::boid_Init(float x, float y)
{
	float xx = rand() % 100 - 50.0f;
